{
    "fr":{
        "date1": "Septembre 2017",
        "title1": "Semestre Erasmus à Riga, Lettonie",
        "riga1": "Fin de l'année je commence la troisième année d'école d'ingénieurs, année décisive pour donner une direction précise à sa carrière professionnelle. À ce moment-là j'étais plutôt désabusé concernant mon avenir, car les deux années précédentes m'avaient déçu au niveau de l'enseignement. Les contenus surtout théoriques, dans la lignée des classes préparatoires, étaient cependant de qualité inférieure. Quant aux projets de modélisation ils étaient intellectuellement intéressants, mais toujours abstraits. Bref je ne savais pas ce que je voulais faire de ma vie et j'ai décidé de partir à l'étranger. En septembre 2017, je suis arrivé à Riga.",
        "riga2": "Cela a été une immense bouffée d'air frais, tant au niveau personnel que professionnel. Le volume horaire de cours était léger (15h / semaine) et cela m'a permis de me développer personnellement. J'ai appris à me débrouiller par mes propres moyens, dans une culture et une langue différentes. J'ai fait de magnifiques rencontres et j'ai pris goût au voyage et à l'aventure ! J'ai pu voyager en Lettonie, Lituanie et Estonie, en Suède et aussi en Islande. C'était une période de ma vie incroyable tant elle était rythmée par la découverte !",
        "riga3": "Avec un de mes colocataires qui lui aussi était étudiant en informatique, nous passions beaucoup de temps à coder tous les deux, nous faisions des exercices de",
        "riga4": " Python et C++ ",
        "riga5": "sur CodingGame. J'ai pris beaucoup de plaisir à cette époque à apprendre à coder et j'ai commencé à chercher un stage en algorithmique. Finalement, j'ai trouvé un stage de développement chez <strong> ThermoFisher Scientific</strong>, entreprise américaine de logiciels dans le secteur de l'imagerie médicale.",
        "date2": "Février 2018",
        "title2": "Développement d'un algorithme de recalage élastique d'images",
        "bordeaux1": "Durant ces six mois, j'ai été confronté à de l'informatique pratique, et j'ai du me familiariser avec tous les outils de gestion de version, de déploiments, de tests qu'il est indispensable de maîtriser au sein d'une entreprise. Je ne travaillais plus sur un projet personnel, mais bien en équipe sur un logiciel avec des milliers d'utilisateurs! J'ai appris à utiliser Git et Microsoft Visual Studios qui sont des outils indispensables de développement. J'ai appris à développer des tests unitaires et des tests d'intégration pour stabiliser les briques fondamentales de l'algorithme que je développais. J'ai également manipulé des outils comme CMake , Trello et Jira . Enfin, j'ai mobilisé toutes mes capacités d'abstraction afin d'étudier la littérature existante et de l'adapter pour développer notre propre algorithme de recalage ",
        "bordeaux2": "dont je parle plus en détails ici.",
        "date3": "Octobre 2018",
        "title3": "Volontariat Internationnal en Entreprise (VIE) à Antananarivo, Madagascar",
        "mad1" : "À la suite de ce stage, j'avais un besoin toujours plus grandissant de découvertes et j'étais définitivement mordu de développement. J'ai été accepté en VIE à Madagascar au sein de l'entreprise ",
        "mad2" : "pour faire des tests de développement sur un logiciel appelé GStarCAD et par la suite monter une équipe de développeurs. Cette période-là a été l'époque de beaucoup de premières fois: première longue expatriation, premier travail, premières responsabilités ...",
        "mad3" : "Futurmap est une entreprise de traitements de données géographiques. Les collectivités françaises ont entre autres l'obligation d'avoir une base de données géoréférencées à jour de leur territoire. Pour réaliser ces plans, des voitures surmontées de caméra LIDAR parcourent les zones urbaines et péri-urbaines. Concernant les zones rurales le traitement est généralement effectué avec du Lidar aérien. La caméra émet un laser qui est réfléchi par les objets autour du véhicule. Le rayon réfléchi est ensuite capté par la caméra, et les données sont stockées sous forme de nuage de points, ce qui représente d'importants volumes. C'est dans ce contexte que Futurmap se propose de sous-traiter la mise en dessin de ces données.",
        "mad4": "Le but de mon contrat était de développer des outils qui permettent de travailler avec des nuages de points dans",
        "mad5": "GStarCAD, clone chinois d'AutoCAD",
        "mad6": "dont la license coûte moins cher. Mais de paire avec le prix inférieur, les fonctionnalités du logiciel sont également inférieures, notamment concernant les nuages de points. Ma mission dans l'entreprise a été d'oeuvrer au développement de GStarCAD en vue de son adoption totale en production (on parle de plus de 250 dessinateurs). Cette mission de VIE s'est découpée en trois parties:",
        "mad7": "Compiler la librairie C++ Open Source de nuages de points ",
        "mad8": "et essayer de charger des nuages de points dans le logiciel pour vérifier que l'affichage et le temps de réaction soient corrects. Suite à cette première validation, j'ai mis en place un algorithme de préparation de données afin de convertir des données clients au format .laz vers des données au format .pcd pour afficher les nuages dans GStarCAD. Ensuite j'ai développé un objet 'PointCloud' permettant de charger des données dans GStarCAD puis de modifier la couleurs des points, d'effectuer des coupes dans le nuage, de faire des recherches spécifiques etc ...",
        "mad9": "Six mois plus tard, les tests d'intégration de l'objet nuage étant concluants, j'ai",
        "mad10": "recruté trois développeurs et un alternant",
        "mad11": "malgache. Le but de cette équipe était notamment d'accompagner la croissance et le développement de l'entreprise en mettant en place de nouvelles méthodes de dessin et de contrôle qualité.",
        "mad12": "La seconde année de mon VIE j'avais à la fois une position de",
        "mad13": " leader technique et d'encadrant / manager ",
        "mad14": "des projets, c'est-à-dire que je faisais le pont entre les demandes des chefs de départements en production et les développeurs. Je m'occupais notamment de la planification sur le long terme des projets (sur plusieurs mois). Je programmais des sprints de l'ordre de deux semaines et tous les matins j'organisais le déroulement d'une petite réunion d'une dizaine de minutes où l'équipe abordait les problèmes sur lesquels elle avait travaillé. Je mettais en place également les dépôts Git pour que la collaboration de l'équipe se déroule au mieux. Enfin j'avais mis en place également une documentation Développeur ET Utilisateur pour qu'il y ait une trace des fonctionnements de chaque commande.",
        "mad15": "En paralèle de l'équipe de développeurs C++,",
        "mad16": "j'encadrais un développeur Python",
        "mad17": "qui avait développé avec TensorFlow un algorithme de reconnaissance d'images. Lorsque certaines équipes de production étaient en 'sous-charge' de travail, en attendant que la charge soit rétablie l'équipe réalisait de l'annotation d'images. Cela consistait à tracer des 'Bounding Box' sur des objets ponctuels tels que les bouches à clefs, les regards, les bornes à incendie etc... Cependant la précision exigée par les clients ne nous permettaient pas d'utiliser l'algorithme de deep learning pour du dessin pur, mais plutôt pour effectuer un contrôle entre les objets détectés et ceux dessinés en prodution.",
        "title4": "Ingénieur logiciel dessin 3D, Sogélink",
        "date4": "Février 2020",
        "paris1": "J'ai intégré l'entreprise Géomédia en février 2021, en tant qu'ingénieur logiciel 3D, en remote à temps plein. La solution que propose Géomédia s'appelle",
        "paris2": ", il s'agit d'un logiciel d'aide au dessin dans le domaine dans la construction. Plus largement, ce logiciel s'inscrit dans les solutions du groupe Sogelink qui a racheté l'entreprise courant 2021. Le gros de mon travail consiste à développer un module géotechnique dans le logiciel afin de modéliser des couches géologiques sur des modèles numériques de terrain (MNT). Concrètement, une fois la modélisation du terrain réalisée, les ingénieurs géotechniciens saisissent dans leur dessin des points de sondage qu'ils ont relevé sur le terrain en renseignant la nature des couches géologiques qui ont été rencontrées. Mon module calcule ensuite les couches ",
        "paris3": "(calcul parallélisé, utilisation de std::thread)",
        "paris4": " et permet de les visualiser en 2D (vue en coupe) et 3D (vue en orbite) la modélisation des couches géologiques. J'ai ensuite adapté les autres modules 'métier du logiciel' pour qu'ils prennent en compte cette notion géologique dans leurs calculs.",
        "title5": "Freelance applications web Typescript / React / NodeJS",
        "date5": "Septembre 2022",
        "free1" : "Au bout de quatre - cinq années de travail dans le logiciel en entreprise, j'ai ressenti le besoin d'explorer de nouvelles méthodes de travail, et de tester de nouvelles techno, plus modernes et plus tournées vers les web-applications. J'avais besoin aussi de voir plus grand, et de travailler sur un projet dans son 'ensemble' et plus uniquement sur quelques briques. J'ai donc décidé de me former en temps qu'ingé full-stack sur les technologies React et NodeJS. J'ai commencé par suivre les formations de Mosh Hamedani, des formations très complètes mises en pratique sur une application concrète.",
        "free2" : "En parallèle, j'ai commencé à travailler avec un client contacté via la plateforme Malt. J'ai ainsi rejoint une équipe de quatre développeurs et le projet était de développer une application de gestion de projets, de tâches et de ressources pour le monde industriel. J'ai directement mis en pratique les connaissances acquises sur les technologies React et NodeJS et le combo cours / projet m'a permis de progresser très rapidement.",
        "free3" : "Par exemple, une des features sur lesquelles j'ai travaillé est le suivi d'indicateurs, afin de pouvoir étudier l'avancement d'un projet, comme le nombre d'objets créés, le nombre d'accidents de travail, etc ...",
        "free4" : "Un indicateur peut comporter plusieurs courbes, par exemple dans une usine de création de mobiliers, une courbe pour représenter le nombre de fauteuils produits par jour, et une courbe pour le nombre de chaises. En plus de ces données, l'utilisateur a la possibilité de renseigner les objectifs, il s'agit dans l'exemple précédent du nombre de chaises ou de fauteuils à produire. Ensuite, les équipes viennent saisir au jour le jour dans l'application, les valeurs observées réellement.",
        "free5" : "Enfin la dernière étape est la visualisation des données. Pour cela j'ai utilisé la librairie de visualisation de données ChartJS. L'indicateur présenté est hebdomadaire, c'-à-d que les données sont saisies chaque semaine. En fonction de si la valeur cible a été atteinte les histogrammes ont une couleur verte ou rouge.",
        "title6": "Freelance sur une application de pisciculture",
        "date6": "Avril 2023",
        "free6" : "J'ai ensuite travaillé sur un projet de pisciculture. L'objectif était de pouvoir paramétrer son installation dans l'application: c'est-à-dire le nombre de bassins, les espèces de poissons, et le type d'aliment utilisé.",
        "free7" : "Dans un second temps, le pisciculteur peut définir des actions sur les bassins de son exploitation depuis la page 'Journal'. Il peut par exemple venir renseigner s'il a fait rentrer un lot de poissons dans un bassin, s'il a réalisé une pesée sur les poissons du bassin, s'il y a eu de la mortalité, s'il a vendu des poissons, s'il les a transférés vers un autre bassin. Une fois qu'il sélectionne un traitement il est invité à saisir la date, l'espèce de poissons et le bassin concerné, et leur quantité.",
        "free8" : "Une fois que le projet est bien paramétré et que des actions ont été créées sur chaque bassin, un algorithme calcule l'évolution de poids moyen des poissons sur le bassin en tenant compte du poids réel mesuré lors des pesées et en l'extrapolant avec la croissance théorique définie en étape 1. Cette évolution est visualisable soit sous forme de grille, soit sous forme de courbe.",
        "free9" : "Enfin, un dernier onglet de l'application calcule automatiquement la quantité d'aliment à distribuer par bassin chaque jour en fonction du nombre de poissons, et de l'aliment qui leur est attribué.",
        "capt1": "Fonctionnement illustratif du Lidar.",
        "capt2": "Digitalisation de nuage de points dans GStarCad.",
        "capt3": "Orbite 3D d'un MNT avec modéolisation de couches géologiques",
        "capt4": "Visualisation en vue de coupe des couches géologiques",
        "capt5": "1. Création d'un indicateur",
        "capt6": "2. Saisie des données",
        "capt7": "3. Visualisation des données",
        "capt8": "1. Affichage de la courbe de croissance d'un poisson avec son aliment.",
        "capt9": "2. Paramétrage des bassins",
        "capt10": "3. Exemple de création d'action sur un bassin.",
        "capt11": "4. Visualisation de l'évolution d'un bassin.",
        "capt12": "5. Fiche journalière de distribution d'aliment.",
        "date7": "Maintenant",
        "title7": "Cherche un travail de développeur fullstack à Toulouse !"
    },
    "en":{
        "date1": "September 2017",
        "title1": "Erasmus semester in Riga, Latvia",
        "riga1": "At the end of the year 2017, I started my third year of engineering school, a crucial year for giving a clear direction to my professional career. At that time, I was rather disillusioned about my future because the previous two years had disappointed me in terms of education. The content, mostly theoretical and similar to preparatory classes, was of lower quality. As for the modeling projects, they were intellectually interesting but always abstract. In short, I didn't know what I wanted to do with my life, so I decided to go abroad. In September 2017, I arrived in Riga.",
        "riga2": "It was a breath of fresh air, both personally and professionally. The class schedule was light (15 hours per week), allowing me to develop personally. I learned to fend for myself in a different culture and language. I had wonderful encounters and developed a taste for travel and adventure! I had the opportunity to travel to Latvia, Lithuania, Estonia, Sweden, and even Iceland. It was an incredible period of my life, filled with discoveries!",
        "riga3": "One of my roommates, who was also a computer science student, and I spent a lot of time coding together. We did exercises in",
        "riga4": " Python and C++ ",
        "riga5": "on CodingGame. I thoroughly enjoyed learning to code during that time, and I began searching for an internship in algorithms. Eventually, I found a development internship at ThermoFisher Scientific, an American software company in the medical imaging sector. ",
        "date2": "February 2018",
        "title2": "Development of an elastic image registration algorithm",
        "bordeaux1": "During those six months, I was confronted with practical computer science and had to familiarize myself with all the version control, deployment, and testing tools that are essential to master within a company. I was no longer working on a personal project, but rather as part of a team on software with thousands of users! I learned to use Git and Microsoft Visual Studio, which are essential development tools. I learned to develop unit tests and integration tests to stabilize the fundamental components of the algorithm I was working on. I also worked with tools like CMake, Trello, and Jira. Lastly, I utilized all my abstraction abilities to study existing literature and adapt it to develop our own registration algorithm, ",
        "bordeaux2": "which I discuss in more detail here.",
        "date3": "October 2018",
        "title3": "Two years mission in a french company in Antananarivo, Madagascar ",
        "mad1" : "Following that internship, my thirst for discovery continued to grow, and I was truly passionate about development. I was accepted for a VIE (Volontariat International en Entreprise) position in Madagascar at",
        "mad2" : "company to perform development tests on a software called GStarCAD and later to set up a team of developers. That period was a time of many firsts for me: first long-term expatriation, first job, first responsibilities..",
        "mad3" : "Futurmap is a company specializing in geographic data processing. French local authorities, among others, have an obligation to maintain an up-to-date georeferenced database of their territory. To create these maps, cars equipped with LIDAR cameras traverse urban and peri-urban areas. For rural areas, aerial LIDAR scanning is typically used. The camera emits a laser beam that is reflected by objects surrounding the vehicle. The reflected beam is then captured by the camera, and the data is stored as a point cloud, resulting in significant volumes of data. In this context, Futurmap offers subcontracting services for the visualization of this data.",
        "mad4": "The purpose of my contract was to develop tools for working with point clouds in",
        "mad5": "GStarCAD, a Chinese clone of AutoCAD",
        "mad6": "that has a lower licensing cost. However, along with the lower price, the software's functionalities are also inferior, especially concerning point clouds. My mission in the company was to contribute to the development of GStarCAD with the goal of its full adoption in production (involving more than 250 draftsmen). This VIE assignment was divided into three parts:",
        "mad7": "Compiling the open-source C++ library for point clouds, ",
        "mad8": "and attempting to load point clouds into the software to verify correct display and responsiveness. After this initial validation, I implemented a data preparation algorithm to convert customer data from .laz format to .pcd format for displaying the clouds in GStarCAD. Then, I developed a 'PointCloud' object for loading data into GStarCAD and modifying point colors, performing cut-outs in the cloud, conducting specific searches, and more.",
        "mad9": "Six months later, with successful integration tests of the point cloud object, ",
        "mad10": "I recruited three developers and one Malagasy intern.",
        "mad11": "The objective of this team was to support the company's growth and development by implementing new drawing and quality control methods.",
        "mad12": "In the second year of my VIE, I held both a",
        "mad13": " technical leadership position and a project oversight/management role, ",
        "mad14": "acting as a bridge between the production department's requests and the developers. I was responsible for long-term project planning (spanning several months) and organized sprints of approximately two weeks. Every morning, I conducted a brief team meeting of about ten minutes to discuss the issues they had worked on. I also set up Git repositories to facilitate seamless collaboration within the team. Additionally, I created both Developer and User documentation to document the functioning of each command.",
        "mad15": "In parallel with the C++ development team,",
        "mad16": "I supervised a Python developer",
        "mad17": "who had used TensorFlow to develop an image recognition algorithm. When certain production teams had a reduced workload, the team would perform image annotation while waiting for the workload to pick up. This involved drawing bounding boxes around specific objects such as keychains, manholes, fire hydrants, etc. However, due to the precision required by clients, we couldn't use the deep learning algorithm for pure drawing purposes. Instead, it was used for cross-checking the detected objects with those drawn in production as a form of quality control.",
        "title4": "3D Drawing software engineer, Sogélink",
        "date4": "February 2020",
        "paris1": "I joined Géomédia in February 2021 as a full-time remote 3D software engineer. The solution offered by Géomédia is called",
        "paris2": ", which is a software used for drawing assistance in the construction industry. More broadly, this software is part of the Sogelink group's solutions, as Sogelink acquired Géomédia in 2021. The main focus of my work is to develop a geotechnical module within the software for modeling geological layers on digital terrain models (DTMs). In practice, once the terrain modeling is done, geotechnical engineers input the survey points they have collected in the field, along with the information about the encountered geological layers. My module then calculates the layers ",
        "paris3": "(using parallelized calculations and std::thread utilization) ",
        "paris4": " and allows for their visualization in 2D (cross-sectional view) and 3D (orbital view) for the geological layer modeling. I have also adapted other 'business modules' in the software to incorporate this geological aspect into their calculations.",
        "title5": "Working in Freelance on web applications in Typescript / React / NodeJS",
        "date5": "September 2022",
        "free1" : "After four to five years of working in software development in the corporate world, I felt the need to explore new working methods and test out more modern technologies focused on web applications. I also wanted to work on a project as a whole, rather than just working on specific components. Therefore, I decided to train myself as a full-stack engineer with a focus on React and Node.js technologies. I started by taking courses from Mosh Hamedani, which were comprehensive and practical, involving a real-world application.",
        "free2" : "At the same time, I began working with a client I found through the Malt platform. I joined a team of four developers, and our project involved developing a project, task, and resource management application for the industrial sector. I immediately applied the knowledge I gained from React and Node.js technologies, and the combination of the courses and the project allowed me to progress rapidly.",
        "free3" : "For example, one of the features I worked on was the tracking of indicators, which enabled the study of project progress, such as the number of created objects or the number of work accidents, and so on.",
        "free4" : "An indicator can consist of multiple curves. For example, in a furniture manufacturing factory, there can be a curve representing the number of armchairs produced per day and another curve representing the number of chairs. In addition to these data points, the user has the option to input goals. In the previous example, these goals would be the target number of chairs or armchairs to be produced. Then, on a daily basis, teams enter the actual observed values into the application.",
        "free5" : "The final step is data visualization. For this purpose, I utilized the Chart.js library for data visualization. The indicator is presented on a weekly basis, meaning that data is entered each week. Depending on whether the target value has been achieved, the histograms are displayed in green or red color.",
        "title6": "Freelancing on a Fish Farming Application",
        "date6": "April 2023",
        "free6" : "I then worked on a fish farming project. The goal was to be able to configure the fish farm in the application, including the number of ponds, fish species, and the type of feed used.",
        "free7" : "In the next step, the fish farmer can perform various actions on the ponds of their fish farm through the 'Journal' page. For example, they can record if they have stocked a batch of fish in a pond, conducted a weighing of the fish in a pond, experienced any mortality, sold fish, or transferred fish to another pond. When selecting a specific action, they are prompted to enter the date, fish species, pond, and quantity associated with that action.",
        "free8" : "Once the project is properly configured and actions have been created for each pond, an algorithm calculates the average weight evolution of the fish in each pond. It takes into account the actual weights measured during the weighings and extrapolates them based on the theoretical growth defined in step 1. This weight evolution can be visualized either as a grid or as a curve, providing insights into the growth progress of the fish in each pond.",
        "free9" : "Finally, a last tab in the application automatically calculates the quantity of feed to be distributed per pond each day based on the number of fish and the assigned feed type. This feature ensures that the appropriate amount of feed is provided to each pond, taking into account the specific requirements of the fish population in terms of nutrition and growth.",        
        "capt1": "Illustrative Operation of Lidar.",
        "capt2": "Point Cloud Digitization in GStarCAD.",
        "capt3": "3D Orbit of a DTM with Geological Layer Modeling.",
        "capt4": "Visualization of Geological Layers in Cross-Section View.",
        "capt5": "1. Creation of an Indicator.",
        "capt6": "2. Data Entry.",
        "capt7": "3. Data Visualization.",
        "capt8": "1. Display of Fish Growth Curve with Feed.",
        "capt9": "2. Pond Configuration.",
        "capt10": "3. Example of Action Creation on a Pond.",
        "capt11": "4. Pond Evolution Visualization.",
        "capt12": "5. Daily Feed Distribution Record.",
        "date7": "Now",
        "title7": "Looking for a programmer fullstack position in Toulouse !"
    }
}