{
    "fr":{
        "date1": "Septembre 2017",
        "title1": "Semestre Erasmus à Riga, Lettonie",
        "riga1": "Fin de l'année je commence la troisième année d'école d'ingénieurs, année décisive pour donner une direction précise à sa carrière professionnelle. À ce moment-là j'étais plutôt désabusé concernant mon avenir, car les deux années précédentes m'avaient déçu au niveau de l'enseignement. Les contenus surtout théoriques, dans la lignée des classes préparatoires, étaient cependant de qualité inférieure. Quant aux projets de modélisation ils étaient intellectuellement intéressants, mais toujours abstraits. Bref je ne savais pas ce que je voulais faire de ma vie et j'ai décidé de partir à l'étranger. En septembre 2017, je suis arrivé à Riga.",
        "riga2": "Cela a été une immense bouffée d'air frais, tant au niveau personnel que professionnel. Le volume horaire de cours était léger (15h / semaine) et cela m'a permis de me développer personnellement. J'ai appris à me débrouiller par mes propres moyens, dans une culture et une langue différentes. J'ai fait de magnifiques rencontres et j'ai pris goût au voyage et à l'aventure ! J'ai pu voyager en Lettonie, Lituanie et Estonie, en Suède et aussi en Islande. C'était une période de ma vie incroyable tant elle était rythmée par la découverte !",
        "riga3": "Avec un de mes colocataires qui lui aussi était étudiant en informatique, nous passions beaucoup de temps à coder tous les deux, nous faisions des exercices de",
        "riga4": " Python et C++ ",
        "riga5": "sur CodingGame. J'ai pris beaucoup de plaisir à cette époque à apprendre à coder et j'ai commencé à chercher un stage en algorithmique. Finalement, j'ai trouvé un stage de développement chez <strong> ThermoFisher Scientific</strong>, entreprise américaine de logiciels dans le secteur de l'imagerie médicale.",
        "date2": "Février 2018",
        "title2": "Développement d'un algorithme de recalage élastique d'images",
        "bordeaux1": "Ces six mois de stage au sein de l'entreprise ",
        "bordeaux101": "ThermoFisher ",
        "bordeaux102": "ont été pour moi l'occasion d'apprendre à utiliser les outils de développement indispensables tels que ",
        "bordeaux2": "Git et Microsoft Visual Studio",
        "bordeaux3": ". J'ai développé des tests unitaires et d'intégration pour stabiliser les briques fondamentales de mon algorithme. J'ai manipulé des outils de compilation comme ",
        "bordeaux4": "CMake ",
        "bordeaux5": "et de gestion de projet et de bugs, comme ",
        "bordeaux6": "Jira et Trello",
        "bordeaux7": ". Enfin, j'ai mobilisé toutes mes capacités d'abstraction afin d'étudier la littérature existante et de l'adapter pour développer notre propre algorithme de recalage élastique d'images ",
        "bordeaux8": "dont je parle plus en détails ici.",
        "date3": "Octobre 2018",
        "title3": "Volontariat Internationnal en Entreprise (VIE) à Antananarivo, Madagascar",
        "mad1" : "À la suite de ce stage, j'avais un besoin toujours plus grandissant de découvertes et j'étais définitivement mordu de développement. Je suis parti en VIE à Madagascar au sein de l'entreprise ",
        "mad2" : "pour faire des tests de développement sur un logiciel appelé GStarCAD et par la suite monter une équipe de développeurs. ",
        "mad3" : "Futurmap est une entreprise de traitements de données géographiques. Les collectivités françaises ont entre autres l'obligation d'avoir une base de données géoréférencées à jour de leur territoire. Pour réaliser ces plans, des voitures surmontées de caméra LIDAR parcourent les zones urbaines. Concernant les zones rurales le traitement est généralement effectué avec du Lidar aérien. La caméra émet un laser qui est réfléchi par les objets au sol. Le rayon réfléchi est ensuite capté par la caméra, et les données sont stockées sous forme de nuage de points, ce qui représente d'importants volumes. C'est dans ce contexte que Futurmap se propose de sous-traiter la mise en dessin de ces données.",
        "mad4": "Mon but dans l'entreprise était de développer des outils qui permettent de travailler avec des nuages de points dans",
        "mad5": "GStarCAD, clone chinois d'AutoCAD",
        "mad6": "dont la license coûte moins cher. Mais de paire avec le prix inférieur, les fonctionnalités du logiciel sont également inférieures, notamment concernant les nuages de points. Ma mission a été d'oeuvrer au développement de GStarCAD en vue de son adoption totale en production",
        "mad601": "(on parle de plus de 250 dessinateurs). ",
        "mad602": "Cette mission de VIE s'est découpée en trois parties:",
        "mad7": "Compiler la librairie C++ Open Source de nuages de points ",
        "mad8": "et essayer de charger des nuages de points dans le logiciel pour vérifier que l'affichage et le temps de réaction soient corrects. Suite à cette première validation, j'ai mis en place un algorithme de préparation de données afin de convertir des données clients au format .laz vers des données au format .pcd pour afficher les nuages dans GStarCAD. Ensuite j'ai développé un objet 'PointCloud' permettant de charger des données dans GStarCAD puis de modifier la couleurs des points, d'effectuer des coupes dans le nuage, de faire des recherches spécifiques etc ...",
        "mad9": "Six mois plus tard, les tests d'intégration de l'objet nuage étant concluants, j'ai",
        "mad10": "recruté trois développeurs et un alternant",
        "mad11": "malgache. Le but de cette équipe était notamment d'accompagner la croissance et le développement de l'entreprise en mettant en place de nouvelles méthodes de dessin et de contrôle qualité.",
        "mad12": "La seconde année de mon VIE j'avais à la fois une position de",
        "mad13": " leader technique et d'encadrant / manager ",
        "mad14": "des projets, c'est-à-dire que je faisais le pont entre les demandes des chefs de départements en production et les développeurs. Je m'occupais notamment de la planification sur le long terme des projets (sur plusieurs mois). Je programmais des sprints de l'ordre de deux semaines et tous les matins j'organisais le déroulement d'une petite réunion d'une dizaine de minutes où l'équipe abordait les problèmes sur lesquels elle avait travaillé. Je mettais en place également les dépôts Git pour que la collaboration de l'équipe se déroule au mieux. Enfin j'avais mis en place également une documentation Développeur ET Utilisateur pour qu'il y ait une trace des fonctionnements de chaque commande.",
        "mad15": "En paralèle de l'équipe de développeurs C++,",
        "mad16": "j'encadrais un développeur Python",
        "mad17": "qui avait développé avec TensorFlow un algorithme de reconnaissance d'images. Lorsque certaines équipes de production étaient en 'sous-charge' de travail, en attendant que la charge soit rétablie l'équipe réalisait de l'annotation d'images. Cela consistait à tracer des 'Bounding Box' sur des objets ponctuels tels que les bouches à clefs, les regards, les bornes à incendie etc... Cependant la précision exigée par les clients ne nous permettaient pas d'utiliser l'algorithme de deep learning pour du dessin pur, mais plutôt pour effectuer un contrôle entre les objets détectés et ceux dessinés en prodution.",
        "title4": "Ingénieur logiciel dessin 3D, Sogélink",
        "date4": "Février 2020",
        "paris1": "J'ai intégré l'entreprise Géomédia en février 2021, en tant qu'ingénieur logiciel 3D, en remote à temps plein. La solution que propose Géomédia s'appelle",
        "paris2": ", il s'agit d'un logiciel d'aide au dessin dans le domaine de la ",
        "paris201": "cartographie, topographie et construction.",
        "paris202": " Plus largement, ce logiciel s'inscrit dans les solutions du groupe Sogelink qui a racheté l'entreprise courant 2021. Le gros de mon travail consiste à développer un module géotechnique dans le logiciel afin de modéliser des couches géologiques sur des modèles numériques de terrain (MNT). Concrètement, une fois la modélisation du terrain réalisée, les ingénieurs géotechniciens saisissent dans leur dessin des points de sondage qu'ils ont relevé sur le terrain en renseignant la nature des couches géologiques qui ont été rencontrées. Mon module calcule ensuite les couches ",
        "paris3": "(calcul parallélisé, utilisation de std::thread)",
        "paris4": " et permet de les visualiser en 2D (vue en coupe) et 3D (vue en orbite) la modélisation des couches géologiques. J'ai ensuite adapté les autres modules 'métier du logiciel' pour qu'ils prennent en compte cette notion géologique dans leurs calculs.",
        "title5": "Freelance applications web Typescript / React / NodeJS",
        "date5": "Septembre 2022",
        "free1" : "Au bout de quatre - cinq années de travail dans le logiciel en entreprise, j'ai ressenti le besoin d'explorer de nouvelles méthodes de travail, et de tester de nouvelles techno, plus modernes et plus tournées vers les web-applications. J'avais besoin aussi de voir plus grand, et de travailler sur un projet dans son 'ensemble' et plus uniquement sur quelques briques. J'ai donc décidé de me former en temps qu'ingé full-stack sur les technologies React et NodeJS. J'ai commencé par suivre les formations de Mosh Hamedani, des formations très complètes mises en pratique sur une application concrète.",
        "free2" : "En parallèle, j'ai pris une formation en ligne de ",
        "free201": "Javascript, Typescript, React, NodeJS, MongoDB ",
        "free202": "et j'ai commencé à travailler avec un client contacté via la plateforme Malt. J'ai ainsi rejoint une équipe de quatre développeurs et le projet était de développer une application de gestion de projets, de tâches et de ressources pour le monde industriel.",
        "free3" : " Par exemple, une des features sur lesquelles j'ai travaillé est le suivi d'indicateurs, afin de pouvoir étudier l'avancement d'un projet, comme le nombre d'objets créés, le nombre d'accidents de travail, etc ...",
        "free4" : "Un indicateur peut comporter plusieurs courbes, par exemple dans une usine de création de mobiliers, une courbe pour représenter le nombre de fauteuils produits par jour, et une courbe pour le nombre de chaises. En plus de ces données, l'utilisateur a la possibilité de renseigner les objectifs, il s'agit dans l'exemple précédent du nombre de chaises ou de fauteuils à produire. Ensuite, les équipes viennent saisir au jour le jour dans l'application, les valeurs observées réellement.",
        "free5" : "Enfin la dernière étape est la visualisation des données. Pour cela j'ai utilisé la librairie de visualisation de données ChartJS. L'indicateur présenté est hebdomadaire, c'-à-d que les données sont saisies chaque semaine. En fonction de si la valeur cible a été atteinte les histogrammes ont une couleur verte ou rouge.",
        "title6": "Freelance sur une application de pisciculture",
        "date6": "Avril 2023",
        "free6" : "J'ai ensuite travaillé sur un projet de pisciculture. L'objectif était de pouvoir paramétrer son installation dans l'application: c'est-à-dire le nombre de bassins, les espèces de poissons, et le type d'aliment utilisé.",
        "free7" : "Dans un second temps, le pisciculteur peut définir des actions sur les bassins de son exploitation depuis la page 'Journal'. Il peut par exemple venir renseigner s'il a fait rentrer un lot de poissons dans un bassin, s'il a réalisé une pesée sur les poissons du bassin, s'il y a eu de la mortalité, s'il a vendu des poissons, s'il les a transférés vers un autre bassin. Une fois qu'il sélectionne un traitement il est invité à saisir la date, l'espèce de poissons et le bassin concerné, et leur quantité.",
        "free8" : "Une fois que le projet est bien paramétré et que des actions ont été créées sur chaque bassin, un algorithme calcule l'évolution de poids moyen des poissons sur le bassin en tenant compte du poids réel mesuré lors des pesées et en l'extrapolant avec la croissance théorique définie en étape 1. Cette évolution est visualisable soit sous forme de grille, soit sous forme de courbe.",
        "free9" : "Enfin, un dernier onglet de l'application calcule automatiquement la quantité d'aliment à distribuer par bassin chaque jour en fonction du nombre de poissons, et de l'aliment qui leur est attribué.",
        "capt1": "Fonctionnement illustratif du Lidar.",
        "capt2": "Digitalisation de nuage de points dans GStarCad.",
        "capt3": "Orbite 3D d'un MNT avec modéolisation de couches géologiques",
        "capt4": "Visualisation en vue de coupe des couches géologiques",
        "capt5": "1. Création d'un indicateur",
        "capt6": "2. Saisie des données",
        "capt7": "3. Visualisation des données",
        "capt8": "1. Affichage de la courbe de croissance d'un poisson avec son aliment.",
        "capt9": "2. Paramétrage des bassins",
        "capt10": "3. Exemple de création d'action sur un bassin.",
        "capt11": "4. Visualisation de l'évolution d'un bassin.",
        "capt12": "5. Fiche journalière de distribution d'aliment.",
        "date7": "Maintenant",
        "title7": "Cherche un travail de développeur fullstack à Toulouse !"
    },
    "en":{
        "date1": "September 2017",
        "title1": "Erasmus Semester in Riga, Latvia",
        "riga1": "At the end of the year, I started the third year of engineering school, a decisive year to give a precise direction to my professional career. At that time, I was quite disillusioned about my future because the previous two years had disappointed me in terms of education. The mostly theoretical content, in line with preparatory classes, was of lower quality. As for modeling projects, they were intellectually interesting but still abstract. In short, I didn't know what I wanted to do with my life, so I decided to go abroad. In September 2017, I arrived in Riga.",
        "riga2": "It was a breath of fresh air, both personally and professionally. The course workload was light (15h/week), allowing me to develop personally. I learned to fend for myself in a different culture and language. I made wonderful connections and developed a taste for travel and adventure! I had the opportunity to travel to Latvia, Lithuania, Estonia, Sweden, and even Iceland. It was an incredible period of my life, filled with discovery!",
        "riga3": "With one of my roommates, who was also a computer science student, we spent a lot of time coding together, working on Python and C++ exercises on CodingGame. I enjoyed learning to code during that time and started looking for an internship in algorithms. Eventually, I found a development internship at <strong> ThermoFisher Scientific</strong>, an American software company in the field of medical imaging.",
        "date2": "February 2018",
        "title2": "Development of an elastic image registration algorithm",
        "bordeaux1": "During these six months of internship at ",
        "bordeaux101": "ThermoFisher ",
        "bordeaux102": "I learned to use essential development tools such as ",
        "bordeaux2": "Git and Microsoft Visual Studio",
        "bordeaux3": ". I developed unit and integration tests to stabilize the fundamental components of my algorithm. I worked with compilation tools like ",
        "bordeaux4": "CMake ",
        "bordeaux5": "and project and bug management tools like ",
        "bordeaux6": "Jira and Trello",
        "bordeaux7": ". Finally, I used all my abstraction abilities to study existing literature and adapt it to develop our own elastic image registration algorithm, which I discuss in more detail here.",
        "date3": "October 2018",
        "title3": "International Volunteering in Business in Antananarivo, Madagascar",
        "mad1": "Following this internship, my desire for discovery grew even stronger, and I was definitively hooked on development. I went on a VIE to Madagascar within the company ",
        "mad2": "to conduct development tests on software called GStarCAD and subsequently set up a team of developers.",
        "mad3": "Futurmap is a company specializing in geographic data processing. French communities are obligated to have an up-to-date georeferenced database of their territory. To create these plans, cars equipped with LIDAR cameras traverse urban areas. For rural areas, aerial LIDAR is typically used. The camera emits a laser reflected by objects on the ground. The reflected beam is then captured by the camera, and the data is stored as a point cloud, representing significant volumes. In this context, Futurmap offers to subcontract the drawing of this data.",
        "mad4": "My goal in the company was to develop tools for working with point clouds in",
        "mad5": "GStarCAD, a Chinese AutoCAD clone",
        "mad6": "with a lower cost license. However, along with the lower price, the software's features are also inferior, especially regarding point clouds. My mission was to contribute to the development of GStarCAD for its complete adoption in production",
        "mad601": "(involving more than 250 draftsmen). ",
        "mad602": "This VIE mission was divided into three parts:",
        "mad7": "Compile the Open Source C++ point cloud library ",
        "mad8": "and try to load point clouds into the software to verify correct display and reaction time. After this initial validation, I implemented a data preparation algorithm to convert client data from .laz format to .pcd format for displaying clouds in GStarCAD. Then, I developed a 'PointCloud' object allowing the loading of data into GStarCAD and modifying the colors of points, performing cuts in the cloud, conducting specific searches, etc...",
        "mad9": "Six months later, with successful integration tests of the point cloud object, I",
        "mad10": "hired three developers and an intern",
        "mad11": "from Madagascar. The goal of this team was to support the company's growth and development by implementing new drawing and quality control methods.",
        "mad12": "During the second year of my VIE, I had both a position as a",
        "mad13": "technical leader and supervisor/manager",
        "mad14": "of projects, acting as a bridge between production department requests and developers. I was responsible for long-term project planning (over several months). I scheduled sprints for about two weeks, and every morning, I organized a short 10-minute meeting where the team discussed the issues they had worked on. I also set up Git repositories to ensure smooth team collaboration. Finally, I also established Developer AND User documentation to have a record of the functionality of each command.",
        "mad15": "In addition to the C++ development team,",
        "mad16": "I supervised a Python developer",
        "mad17": "who had developed an image recognition algorithm with TensorFlow. When some production teams had a 'low workload,' while waiting for the workload to be restored, the team conducted image annotation. This involved outlining 'Bounding Boxes' on specific objects such as keyholes, gazes, fire hydrants, etc. However, the precision required by clients did not allow us to use the deep learning algorithm for pure drawing but rather to perform a check between the detected and drawn objects in production.",
        "title4": "3D Drawing Software Engineer, Sogélink",
        "date4": "February 2020",
        "paris1": "I joined the company Géomédia in February 2021 as a 3D software engineer, working remotely full-time. The solution offered by Géomédia is called",
        "paris2": ", a software for drawing assistance in the field of ",
        "paris201": "cartography, topography, and construction.",
        "paris202": " More broadly, this software is part of the Sogelink group's solutions, which acquired the company in 2021. The majority of my work involves developing a geotechnical module in the software to model geological layers on digital terrain models (DTM). In practice, once the terrain modeling is done, geotechnical engineers enter probing points in their drawings, indicating the nature of the geological layers encountered. My module then calculates the layers ",
        "paris3": "(parallelized calculation, use of std::thread)",
        "paris4": " and allows visualization in 2D (cross-section view) and 3D (orbit view) of the geological layers. I then adapted the other 'business modules' of the software to incorporate this geological concept into their calculations.",
        "title5": "Freelance Web Applications Typescript / React / NodeJS",
        "date5": "September 2022",
        "free1": "After four to five years of working in software in companies, I felt the need to explore new work methods and test newer, more web-oriented technologies. I also wanted to work on a project as a whole, not just on a few components. So, I decided to train as a full-stack engineer in React and NodeJS technologies. I started by taking courses by Mosh Hamedani, very comprehensive courses applied to a concrete application.",
        "free2": "In parallel, I took an online course on ",
        "free201": "Javascript, Typescript, React, NodeJS, MongoDB ",
        "free202": "and started working with a client contacted through the Malt platform. I joined a team of four developers, and the project was to develop a project, task, and resource management application for the industrial world.",
        "free3": "For example, one of the features I worked on is tracking indicators to study the progress of a project, such as the number of objects created, the number of work accidents, etc...",
        "free4": "An indicator can have multiple curves, for example, in a furniture manufacturing plant, a curve representing the number of chairs produced per day and another for the number of sofas. In addition to this data, the user can set goals; in the previous example, it could be the number of chairs or sofas to be produced. Then, teams enter daily observations in the application, such as the actual observed values.",
        "free5": "Finally, the last step is data visualization. For this, I used the ChartJS data visualization library. The presented indicator is weekly, meaning that data is entered each week. Depending on whether the target value was achieved, the histograms are colored green or red.",
        "title6": "Freelance on a Fish Farming Application",
        "date6": "April 2023",
        "free6": "I then worked on a fish farming project. The goal was to configure the installation in the application: the number of basins, fish species, and the type of feed used.",
        "free7": "Next, the fish farmer can define actions on the basins of his farm from the 'Journal' page. For example, he can report if he has introduced a batch of fish into a basin, if he has weighed the fish in the basin, if there has been mortality, if he has sold fish, or if he has transferred them to another basin. Once he selects an action, he is prompted to enter the date, fish species, and the relevant basin, along with their quantity.",
        "free8": "Once the project is well configured and actions have been created for each basin, an algorithm calculates the average weight evolution of the fish in the basin, taking into account the real weight measured during weighings and extrapolating it with the theoretical growth defined in step 1. This evolution can be viewed either as a grid or as a curve.",
        "free9": "Finally, a last tab in the application automatically calculates the quantity of feed to be distributed per basin each day based on the number of fish and the assigned feed.",
        "capt1": "Illustrative operation of Lidar.",
        "capt2": "Point cloud digitization in GStarCad.",
        "capt3": "3D orbit of a DTM with geological layer modeling",
        "capt4": "Cross-sectional view of geological layers",
        "capt5": "1. Creating an indicator",
        "capt6": "2. Entering data",
        "capt7": "3. Data visualization",
        "capt8": "1. Display of the growth curve of a fish with its feed.",
        "capt9": "2. Basin configuration",
        "capt10": "3. Example of action creation on a basin.",
        "capt11": "4. Visualization of the evolution of a basin.",
        "capt12": "5. Daily feed distribution record.",
        "date7": "Now",
        "title7": "Looking for a full-stack developer job in Toulouse!"
      }      
}